apache/nuttx/arch/arm/src/stm32/stm32f40xxx_i2c.c
          i2cinfo("Address ACKed beginning data reception\n");
          i2cinfo("short read N=2: programming NACK\n");

          /* Trace */

          stm32_i2c_traceevent(priv, I2CEVENT_ADDRESS_ACKED_READ_2, 0);
        }
      else
        {
          i2cinfo("Address ACKed beginning data reception\n");

          /* Clear ADDR flag by reading SR2 and adding it to status */

          status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

          /* Trace */

          stm32_i2c_traceevent(priv, I2CEVENT_ADDRESS_ACKED, 0);

#ifdef CONFIG_STM32_I2C_DMA
          /* DMA only when not doing a short read */

          i2cinfo("Starting dma transfer and disabling interrupts\n");

          /* The DMA must be initialized and enabled before the I2C data
           * transfer.
           * The DMAEN bit must be set in the I2C_CR2 register before the
           * ADDR event.
           */

          stm32_dmasetup(priv->rxdma,
                         priv->config->base + STM32_I2C_DR_OFFSET,
                         (uint32_t)priv->ptr, priv->dcnt,
                         DMA_SCR_DIR_P2M |
                         DMA_SCR_MSIZE_8BITS |
                         DMA_SCR_PSIZE_8BITS |
                         DMA_SCR_MINC |
                         I2C_DMA_PRIO);

          /* Do not enable the ITBUFEN bit in the I2C_CR2 register if DMA is
           * used.
           */

          stm32_i2c_modifyreg(priv,
                              STM32_I2C_CR2_OFFSET, I2C_CR2_ITBUFEN, 0);

#ifndef CONFIG_I2C_POLLED
          /* Now let DMA do all the work, disable i2c interrupts */

          regval  = stm32_i2c_getreg(priv, STM32_I2C_CR2_OFFSET);
          regval &= ~I2C_CR2_ALLINTS;
          stm32_i2c_putreg(priv, STM32_I2C_CR2_OFFSET, regval);
#endif

          /* The user can generate a Stop condition in the DMA Transfer
           * Complete interrupt routine if enabled. This will be done in
           * the dma rx callback Start DMA.
           */

          stm32_dmastart(priv->rxdma, stm32_i2c_dmarxcallback, priv, false);
          stm32_i2c_modifyreg(priv, STM32_I2C_CR2_OFFSET, 0, I2C_CR2_DMAEN);
#else
#ifndef CONFIG_I2C_POLLED
          if (priv->dcnt > 3)
            {
              /* Don't enable I2C_CR2_ITBUFEN for messages longer than 3
               * bytes
               */

              stm32_i2c_modifyreg(priv,
                                  STM32_I2C_CR2_OFFSET, 0, I2C_CR2_ITBUFEN);
            }
#endif
#endif
        }
    }

  /* Write mode
   *
   * Handles all write related I2C protocol logic. Also handles the
   * ACK event after clearing the ADDR flag as the write has to
   * begin immediately after.
   */

  else if ((priv->flags & I2C_M_READ) == 0 &&
           (status & I2C_SR1_BTF) != 0 &&
            priv->dcnt == 0)
    {
      /* After last byte, check what to do based on next message flags */

      if (priv->msgc == 0)
        {
          /* If last message send stop bit */

          stm32_i2c_sendstop(priv);
          i2cinfo("Stop sent dcnt = %i msgc = %i\n", priv->dcnt, priv->msgc);

          /* Decrease counter to get to next message */

          priv->dcnt--;
          i2cinfo("dcnt %i\n", priv->dcnt);
          stm32_i2c_traceevent(priv, I2CEVENT_WRITE_STOP, priv->dcnt);
        }

      /* If there is a next message with no flags or the read flag
       * a restart sequence has to be sent.
       * Note msgv already points to the next message.
       */

      else if (priv->msgc > 0 &&
               (priv->msgv->flags == 0 ||
               (priv->msgv[0].flags & I2C_M_READ) != 0))
        {
          /* Send start */

          stm32_i2c_sendstart(priv);

          stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);

          i2cinfo("Restart detected!\n");
          i2cinfo("Nextflag %i\n", priv->msgv[0].flags);

          /* Decrease counter to get to next message */

          priv->dcnt--;
          i2cinfo("dcnt %i\n", priv->dcnt);
          stm32_i2c_traceevent(priv, I2CEVENT_WRITE_RESTART, priv->dcnt);
        }
      else
        {
          i2cinfo("Write mode: next message has an unrecognized flag.\n");
          stm32_i2c_traceevent(priv,
                               I2CEVENT_WRITE_FLAG_ERROR, priv->msgv->flags);
        }

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);
    }
  else if ((priv->flags & I2C_M_READ) == 0 &&
           (status & (I2C_SR1_ADDR | I2C_SR1_TXE)) != 0 &&
            priv->dcnt != 0)
    {
      /* The has cleared(ADDR is set, ACK was received after the address)
       * or the transmit buffer is empty flag has been set(TxE) then we can
       * transmit the next byte.
       */

      i2cinfo("Entering write mode dcnt = %i msgc = %i\n",
              priv->dcnt, priv->msgc);

      /* Clear ADDR flag by reading SR2 and adding it to status */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

      /* Address has cleared so don't check on next call */

      priv->check_addr_ack = false;

      /* Check if we have transmitted the whole message or we are after
       * the last byte where the stop condition or else(according to the
       * msg flags) has to be set.
       */

#ifdef CONFIG_STM32_I2C_DMA
      /* if DMA is enabled, only makes sense to make use of it for longer
       * than 1 B transfers.
       */

      if (priv->dcnt > 1)
        {
          i2cinfo("Starting DMA transfer and disabling interrupts\n");

          /* The DMA must be initialized and enabled before the I2C data
           * transfer.  The DMAEN bit must be set in the I2C_CR2 register
           * before the ADDR event.
           */

          stm32_dmasetup(priv->txdma,
                         priv->config->base + STM32_I2C_DR_OFFSET,
                         (uint32_t) priv->ptr, priv->dcnt,
                         DMA_SCR_DIR_M2P |
                         DMA_SCR_MSIZE_8BITS |
                         DMA_SCR_PSIZE_8BITS |
                         DMA_SCR_MINC |
                         I2C_DMA_PRIO);

