apache/nuttx/arch/arm/src/stm32/stm32f40xxx_i2c.c
          /* Do not enable the ITBUFEN bit in the I2C_CR2 register if DMA is
           * used.
           */

          stm32_i2c_modifyreg(priv,
                              STM32_I2C_CR2_OFFSET, I2C_CR2_ITBUFEN, 0);

#ifndef CONFIG_I2C_POLLED
          /* Now let DMA do all the work, disable i2c interrupts */

          regval  = stm32_i2c_getreg(priv, STM32_I2C_CR2_OFFSET);
          regval &= ~I2C_CR2_ALLINTS;
          stm32_i2c_putreg(priv, STM32_I2C_CR2_OFFSET, regval);
#endif

          /* In the interrupt routine after the EOT interrupt, disable DMA
           * requests then wait for a BTF event before programming the Stop
           * condition. To do this, we'll just call the ISR again in
           * DMA tx callback, in which point we fall into the msgc==0 case
           * which ultimately sends the stop..TODO: but we don't explicitly
           * wait for BTF bit being set...
           * Start DMA.
           */

          stm32_i2c_modifyreg(priv, STM32_I2C_CR2_OFFSET, 0, I2C_CR2_DMAEN);
          stm32_dmastart(priv->txdma, stm32_i2c_dmatxcallback, priv, false);
        }
      else
#endif /* CONFIG_STM32_I2C_DMA */
        {
#ifndef CONFIG_I2C_POLLED
          if (priv->dcnt == 1 &&
              (priv->msgc == 0 || (priv->msgv->flags & I2C_M_NOSTART) == 0))
            {
              stm32_i2c_modifyreg(priv,
                                  STM32_I2C_CR2_OFFSET, I2C_CR2_ITBUFEN, 0);
            }
#endif

          /* Transmitting message.
           * Send byte == write data into write register
           */

          stm32_i2c_putreg(priv, STM32_I2C_DR_OFFSET, *priv->ptr++);

          /* Decrease current message length */

          stm32_i2c_traceevent(priv, I2CEVENT_WRITE_TO_DR, priv->dcnt);
          priv->dcnt--;

          if ((status & I2C_SR1_ADDR) != 0 && priv->dcnt > 0)
            {
              /* Transmitting message.
               * ADDR -> BTF & TXE - Send one more byte
               */

              stm32_i2c_putreg(priv, STM32_I2C_DR_OFFSET, *priv->ptr++);

              /* Decrease current message length */

              stm32_i2c_traceevent(priv, I2CEVENT_WRITE_TO_DR, priv->dcnt);
              priv->dcnt--;
            }

#ifndef CONFIG_I2C_POLLED
          if (((status & I2C_SR1_ADDR) != 0 && priv->dcnt > 0) ||
              (priv->msgc > 0 && (priv->msgv->flags & I2C_M_NOSTART) != 0))
            {
              stm32_i2c_modifyreg(priv,
                                  STM32_I2C_CR2_OFFSET, 0, I2C_CR2_ITBUFEN);
            }
#endif

          if (priv->dcnt == 0 &&
              priv->msgc > 0 && (priv->msgv->flags & I2C_M_NOSTART) != 0)
            {
              /* Set condition to get to next message */

              priv->dcnt = -1;
              stm32_i2c_traceevent(priv,
                                   I2CEVENT_WRITE_NO_RESTART, priv->dcnt);
            }
        }
    }

  /* Read mode
   *
   * Handles all read related I2C protocol logic.
   *
   * * * * * * * WARNING STM32F1xx HARDWARE ERRATA * * * * * * *
   *
   * source: https://github.com/hikob/openlab/blob/master/drivers/stm32/i2c.c
   *
   * RXNE-only events should not be handled since it sometimes
   * fails. Only BTF & RXNE events should be handled (with the
   * consequence of slowing down the transfer).
   *
   * It seems that when a RXNE interrupt is handled 'around'
   * the end of the next byte reception, the DR register read
   * is ignored by the i2c controller: it does not flush the
   * DR with next byte
   *
   * Thus we read twice the same byte and we read effectively
   * read one byte less than expected from the i2c slave point
   * of view.
   *
   * Example:
   * + we want to receive 6 bytes (B1 to B6)
   * + the problem appear when reading B3
   * -> we read B1 B2 B3 B3 B4 B5(B3 twice)
   * -> the i2c transfer was B1 B2 B3 B4 B5(B6 is not sent)
   */

  else if ((priv->flags & (I2C_M_READ)) != 0 &&
           (status & (I2C_SR1_RXNE | I2C_SR1_BTF)) != 0)
    {
      /* When read flag is set and the receive buffer is not empty
       * (RXNE is set) then the driver can read from the data register.
       */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

      i2cinfo("Entering read mode dcnt = %i msgc = %i, "
              "status 0x%04" PRIx32 "\n",
              priv->dcnt, priv->msgc, status);

      /* Byte #N-3W, we don't want to manage RxNE interrupt anymore, bytes
       * N, N-1, N-2 will be read with BTF:
       */

#ifndef CONFIG_I2C_POLLED
      if (priv->dcnt < 5)
        {
          stm32_i2c_modifyreg(priv,
                              STM32_I2C_CR2_OFFSET, I2C_CR2_ITBUFEN, 0);
        }
#else
      if (priv->dcnt == 1 ||
          priv->dcnt > 3 || (status & I2C_SR1_BTF) != 0)
#endif
        {
          /*  BTF: N-2/N-1, set NACK, read N-2 */

          if (priv->dcnt == 3)
            {
              stm32_i2c_modifyreg(priv,
                                  STM32_I2C_CR1_OFFSET, I2C_CR1_ACK, 0);
            }

          /*  BTF: N-1/N, STOP/START, read N-1, N */

          else if (priv->dcnt == 2)
            {
              if (priv->msgc > 0)
                {
                  stm32_i2c_sendstart(priv);
                }
              else
                {
                  stm32_i2c_sendstop(priv);
                }

              /* Read byte #N-1 */

              *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);
              priv->dcnt--;
            }

          /* Read last or current byte */

          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);
          priv->dcnt--;

          if (priv->dcnt == 0)
            {
              priv->dcnt = -1;
            }
        }
    }

  /* Empty call handler
   *
   * Case to handle an empty call to the ISR where it only has to
   * Shutdown
   */

  else if (priv->dcnt == -1 && priv->msgc == 0)
    {
      /* Read rest of the state */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);
      i2cinfo("Empty call to ISR: Stopping ISR\n");
      stm32_i2c_traceevent(priv, I2CEVENT_ISR_EMPTY_CALL, 0);
    }

